# ETL Project

In [1]:
#Dependencies
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

## Extract CSVs into DataFrame

In [2]:
#Read in top250 file and view dataframe 
top250_file = "data/Top250.csv"
top250 = pd.read_csv(top250_file)
top250.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [3]:
#Read in future50 file and view dataframe 
future50_file = "data/Future50.csv"
future50 = pd.read_csv(future50_file)
future50.head()

,Rank,Restaurant,Location,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [4]:
#Read in Independence100 file and view dataframe 
ind100_file = "data/Independence100.csv"
ind100 = pd.read_csv(ind100_file)
ind100.head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0

## Transform DataFrames

In [5]:
#Rename sales columns in future50
future50 = future50.rename(columns={"Sales":"Sales_in_millions"})
future50.head()

,Rank,Restaurant,Location,Sales_in_millions,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [6]:
#Rename sales columns in top250
top250 = top250.rename(columns={"Sales":"Sales_in_millions"})
top250.head()

,Rank,Restaurant,Content,Sales_in_millions,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [7]:
#Drop Content and Headquarters Columns from top250
top250 = top250.drop(columns=["Content", "Headquarters"])
top250.head()

,Rank,Restaurant,Sales_in_millions,YOY_Sales,Units,YOY_Units,Segment_Category
0,1,McDonald's,40412,4.9%,13846,-0.5%,Quick Service & Burger
1,2,Starbucks,21380,8.6%,15049,3.0%,Quick Service & Coffee Cafe
2,3,Chick-fil-A,11320,13.0%,2470,5.0%,Quick Service & Chicken
3,4,Taco Bell,11293,9.0%,6766,2.7%,Quick Service & Mexican
4,5,Burger King,10204,2.7%,7346,0.2%,Quick Service & Burger

In [8]:
#Make the Sales units match across tables
sales_mils = ind100["Sales"]/1000000
ind100["Sales"] = sales_mils
ind100 = ind100.rename(columns={"Sales":"Sales_in_millions"})
ind100.head()

,Rank,Restaurant,Sales_in_millions,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39.080335,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35.218364,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29.104017,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26.916180,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26.900000,62,New York,N.Y.,403000.0

### Group Independent 100 by Restaurant

In [9]:
# Grouby Restaurant, summing by (sales or meals)
ind100_grouped = ind100.groupby(['Restaurant']).sum()
# Drop Rank and Average Check columns
ind100_grouped = ind100_grouped.drop(columns=['Rank', 'Average Check'])
# Group by restaurant and average check, then add to ind100_grouped
avg_check = ind100.groupby(['Restaurant']).mean()
ind100_grouped['Average Check'] = avg_check['Average Check']
# Groupby restaurant and get the counts of how many times that restaurant occurs
counts = ind100.groupby(['Restaurant']).count()
ind100_grouped['Restaurant Count'] = counts['Rank']
# Sort by Sales descending
ind100_grouped = ind100_grouped.sort_values(by='Sales_in_millions', ascending=False)
# Reset index to show new rank
ind100_grouped = ind100_grouped.reset_index()
# Show preview of DF
ind100_grouped.head()

,Restaurant,Sales_in_millions,Meals Served,Average Check,Restaurant Count
0,"Joe's Seafood, Prime Steak & Stone Crab",69.501000,816350.0,86.0,3
1,Gibsons Bar & Steakhouse,63.724826,877430.0,80.0,3
2,Carmine's (Times Square),39.080335,469803.0,40.0,1
3,The Boathouse Orlando,35.218364,820819.0,43.0,1
4,Old Ebbitt Grill,29.104017,892830.0,33.0,1

### Join Future50 and Ind100 on location

In [10]:
# Step 1. Make a copy of Future 50 df
future50_df = future50.copy()
future50_df.head()

,Rank,Restaurant,Location,Sales_in_millions,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [11]:
# Step 2 Split Future50 Locations into cities and states columns into a new df
future50_split = future50_df["Location"].str.split(",", n = 1, expand = True)
future50_split.head()

                  0        1
0           Seattle    Wash.
1         Charlotte     N.C.
2  Huntington Beach   Calif.
3        Wilmington     N.C.
4            Irvine   Calif.

In [12]:
# Step 3 Create City and State columns on existing future50_df then drop the Location column
future50_df["City"]= future50_split[0]
future50_df["State"]= future50_split[1]
future50_df = future50_df.drop(columns = ['Location', 'YOY_Sales', 'Units', 'YOY_Units', 'Unit_Volume', 'Franchising' ])
future50_df.head()

   Rank   Restaurant  Sales_in_millions              City    State
0     1   Evergreens                 24           Seattle    Wash.
1     2  Clean Juice                 44         Charlotte     N.C.
2     3     Slapfish                 21  Huntington Beach   Calif.
3     4   Clean Eatz                 25        Wilmington     N.C.
4     5    Pokeworks                 49            Irvine   Calif.

In [13]:
# Step 4 Create a copy of the Ind100 dataframe and drop unnecessary columns.
ind100_df = ind100.copy()
ind100_df = ind100.drop(columns = ['Average Check', 'Meals Served'])
ind100_df.head()

,Rank,Restaurant,Sales_in_millions,City,State
0,1,Carmine's (Times Square),39.080335,New York,N.Y.
1,2,The Boathouse Orlando,35.218364,Orlando,Fla.
2,3,Old Ebbitt Grill,29.104017,Washington,D.C.
3,4,LAVO Italian Restaurant & Nightclub,26.916180,New York,N.Y.
4,5,Bryant Park Grill & Cafe,26.900000,New York,N.Y.

In [14]:
# Step 5 Merge Future50 and Ind100 on State
top150_df = pd.concat([future50_df, ind100_df], axis=0)
top150_df

    Rank              Restaurant  Sales_in_millions              City    State
0      1              Evergreens          24.000000           Seattle    Wash.
1      2             Clean Juice          44.000000         Charlotte     N.C.
2      3                Slapfish          21.000000  Huntington Beach   Calif.
3      4              Clean Eatz          25.000000        Wilmington     N.C.
4      5               Pokeworks          49.000000            Irvine   Calif.
..   ...                     ...                ...               ...      ...
95    96    George's at the Cove          12.194000          La Jolla   Calif.
96    97               Le Coucou          12.187523          New York     N.Y.
97    98                 Mi Vida          12.032014        Washington     D.C.
98    99                  Upland          11.965564          New York     N.Y.
99   100  Virgil's Real Barbecue          11.391678         Las Vegas     Nev.

[150 rows x 5 columns]

In [15]:
# Step 6 Create New location Rankings
# Sort by Sales descending
top150_df = top150_df.sort_values(by='Sales_in_millions', ascending=False)
# Reset index to show new ranking for location df
top150_df = top150_df.reset_index()
# Make the index start at 1
top150_df.index = np.arange(1, len(top150_df) + 1)
# Rename index to Rank to show new ranking
top150_df.index.names = ['Rank']
# Drop unnecessary columns
top150_df = top150_df.drop(columns = ['index', 'Rank'])
top150_df

                  Restaurant  Sales_in_millions        City    State
Rank
1                  Pokeworks          49.000000      Irvine   Calif.
2      Blue Sushi Sake Grill          49.000000       Omaha     Neb.
3             Bluestone Lane          48.000000    New York     N.Y.
4                LA Crawfish          48.000000     McAllen    Texas
5             The Human Bean          47.000000     Medford     Ore.
...                      ...                ...         ...      ...
146     George's at the Cove          12.194000    La Jolla   Calif.
147                Le Coucou          12.187523    New York     N.Y.
148                  Mi Vida          12.032014  Washington     D.C.
149                   Upland          11.965564    New York     N.Y.
150   Virgil's Real Barbecue          11.391678   Las Vegas     Nev.

[150 rows x 4 columns]

## Load DataFrames into Database

In [16]:
# Import pgadmin password from python file
from etlpw import pw

ModuleNotFoundError: No module named 'etlpw'

In [17]:
# Create Database Connection
engine = create_engine(f'postgresql://postgres:{pw}@localhost:5432/restaurant_db')
#engine = create_engine(f'postgresql://{connection_string}')

In [18]:
# Confirm tables
engine.table_names()

['future50', 'ind100', 'location', 'top150', 'top250']

In [24]:
# Add dataframes to sql for Future 50 df.
future50.to_sql(name='future50', con=engine, if_exists='append', index=False)

In [25]:
# Add dataframes to sql for ind100 df.
ind100.to_sql(name='ind100', con=engine, if_exists='append', index=False)

In [26]:
# Add dataframes to sql for top250 df.
top250.to_sql(name='top250', con=engine, if_exists='append', index=False)

In [27]:
# Add dataframes to sql for location df.
top150_df.to_sql(name='top150', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the Top150 table

In [28]:
pd.read_sql_query('select * from top150', con=engine)

                 Restaurant  Sales_in_millions        City    State
0                 Pokeworks          49.000000      Irvine   Calif.
1     Blue Sushi Sake Grill          49.000000       Omaha     Neb.
2            Bluestone Lane          48.000000    New York     N.Y.
3               LA Crawfish          48.000000     McAllen    Texas
4            The Human Bean          47.000000     Medford     Ore.
..                      ...                ...         ...      ...
145    George's at the Cove          12.194000    La Jolla   Calif.
146               Le Coucou          12.187523    New York     N.Y.
147                 Mi Vida          12.032014  Washington     D.C.
148                  Upland          11.965564    New York     N.Y.
149  Virgil's Real Barbecue          11.391678   Las Vegas     Nev.

[150 rows x 4 columns]